DataProcessors/Renault_СозданиеБыстрогоНапоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_СозданиеБыстрогоНапоминания</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Renault_СообщенияПользователю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_СообщенияПользователю</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробнее</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОбзвона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_CommunicationCenter_СхемыОбзвона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адресаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ознакомлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОзнакомления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_СозданиеБыстрогоНапоминания/Forms/ФормаСообщенияУпр/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Идентификатор", Идентификатор) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Наименование", Наименование);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачальноеОформлениеФормы(); 
КонецПроцедуры

&НаКлиенте
Процедура НачальноеОформлениеФормы() 
	МассивАктив = Новый Массив;
	МассивАктив.Добавить(Элементы.кнСохранить);  	
	
	Renault_ОбщиеФункции.МультибрендОсновноеОформление(МассивАктив);	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если НЕ ЗначениеЗаполнено(Дата) И НЕ ЗначениеЗаполнено(Время) Тогда  		
		Сообщить("Необходимо ввести дату и время!");
		Возврат;   		
	КонецЕсли;
	
	ДанныеНапоминания = Новый Структура("Идентификатор, Дата, Время, Наименование, Сообщение",
		Идентификатор, Дата, Время, Наименование, Сообщение);
		
	СоздатьНапоминание(ДанныеНапоминания);
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьНапоминание(ДанныеНапоминания)
	Идентификатор = ДанныеНапоминания.Идентификатор;
	Дата = ДанныеНапоминания.Дата;
	Время = ДанныеНапоминания.Время; 	
	Наименование = ДанныеНапоминания.Наименование;
	Сообщение = ДанныеНапоминания.Сообщение; 
	ТекПользователь = ПараметрыСеанса.Пользователь;
	ТекСотрудник = ТекПользователь.Сотрудник;
	Показ = Дата(Формат(Дата, "ДФ=yyyyMMdd") + СтрЗаменить(?(СтрДлина(СокрЛП(Время)) = 5, Время, "0" + СокрЛП(Время)), ":", "") + "00");
	
	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент(); 	
	Напоминание.Отправитель = ТекПользователь; 	
	Напоминание.Адресаты.Добавить().Сотрудник = ТекСотрудник; 	
	Напоминание.ДатаОтправки = ТекущаяДата(); 	
	Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.КЦ_Уведомление;
	Напоминание.ИдентификаторОбъекта = Идентификатор;
	Напоминание.Обработано = Ложь;
	Напоминание.ПоказыватьС = Показ;
	Напоминание.ПоказыватьПо = Показ;
	Напоминание.Наименование = Наименование;
	Напоминание.Сообщение = Сообщение;  	
	Напоминание.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элементы.Время.СписокВыбора.Очистить();
	Элементы.Время.СписокВыбора.Добавить("07:00");
	Элементы.Время.СписокВыбора.Добавить("07:30");
	Элементы.Время.СписокВыбора.Добавить("08:00");
	Элементы.Время.СписокВыбора.Добавить("08:30");
	Элементы.Время.СписокВыбора.Добавить("09:00");
	Элементы.Время.СписокВыбора.Добавить("09:30");
	Элементы.Время.СписокВыбора.Добавить("10:00");
	Элементы.Время.СписокВыбора.Добавить("10:30");
	Элементы.Время.СписокВыбора.Добавить("11:00");
	Элементы.Время.СписокВыбора.Добавить("11:30");
	Элементы.Время.СписокВыбора.Добавить("12:00");
	Элементы.Время.СписокВыбора.Добавить("12:30");
	Элементы.Время.СписокВыбора.Добавить("13:00");
	Элементы.Время.СписокВыбора.Добавить("13:30");
	Элементы.Время.СписокВыбора.Добавить("14:00");
	Элементы.Время.СписокВыбора.Добавить("14:30");
	Элементы.Время.СписокВыбора.Добавить("15:00");
	Элементы.Время.СписокВыбора.Добавить("15:30");
	Элементы.Время.СписокВыбора.Добавить("16:00");
	Элементы.Время.СписокВыбора.Добавить("16:30");
	Элементы.Время.СписокВыбора.Добавить("17:00");
	Элементы.Время.СписокВыбора.Добавить("17:30");
	Элементы.Время.СписокВыбора.Добавить("18:00");
	Элементы.Время.СписокВыбора.Добавить("18:30");
	Элементы.Время.СписокВыбора.Добавить("19:00");
	Элементы.Время.СписокВыбора.Добавить("19:30");
	Элементы.Время.СписокВыбора.Добавить("20:00");
	Элементы.Время.СписокВыбора.Добавить("20:30");
	Элементы.Время.СписокВыбора.Добавить("21:00");
	Элементы.Время.СписокВыбора.Добавить("21:30");
	Элементы.Время.СписокВыбора.Добавить("22:00");
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Число(Прав(Текст, 2)) > 59 или Число(Лев(Текст, 2)) > 23 Тогда 
		СтандартнаяОбработка = Ложь;
		Сообщить("Время введено не корректно!");
	КонецЕсли;
КонецПроцедуры
